// components/BiographySection.tsx

import React from 'react'

const BiographySection = () => {
  return (
    <section className='bg-black text-white py-12 px-4'>
      <h2 className='text-3xl font-bold text-center mb-8 text-white'>
        بیوگرافی
      </h2>
      <div className='max-w-4xl mx-auto bg-zinc-900 p-6 rounded-2xl border border-zinc-700 shadow-lg'>
        <p className='text-lg leading-8 mb-4'>
          پرهام رمضان در سن ۶ سالگی کار خود را آغاز کرد ولی از سال ۱۳۸۸ فعالیت
          حرفه‌ای هنری خود را آغاز نمود. او در همان دوران کودکی، زمانی که در
          پارک مشغول بازی بود، به‌صورت اتفاقی وارد یک سکانس از یک گروه سینمایی
          شد و این نقطه‌ی شروع ورود او به دنیای هنر بود. تنها یک سال بعد، نخستین
          حضور جدی او در سینما رقم خورد.
        </p>
        <p className='text-lg leading-8 mb-4'>
          وی در شبکه‌های یک، دو، سه، آموزش و ورزش فعالیت داشته و در پروژه‌های
          مختلفی چون فیلم‌های «رهایی»، «کارآموز»، «حسرت» و...، همچنین سریال‌هایی
          نظیر «عاشقانه»، «سه سوت»، «گروههان» و دیگر آثار تلویزیونی نقش‌آفرینی
          کرده است. از دیگر پروژه‌های شاخص او می‌توان به برنامه‌هایی مانند
          «دورهمی» و «تا نیایش» اشاره کرد.
        </p>
        <p className='text-lg leading-8 mb-4'>
          پرهام رمضان در طول مسیر هنری خود افتخار همکاری با اساتید بزرگی همچون
          زنده‌یاد چنگیز جلیلوند، علی نصیریان، فتحعلی اویسی، سعید مقدم‌منش، سعید
          مظفری و غلامرضا صادقی را داشته است.
        </p>
        <p className='text-lg leading-8 mb-4'>
          او به دقت در جزئیات باور دارد و این ویژگی را عنصر جدایی‌ناپذیر از سبک
          کاری خود می‌داند.
        </p>

        {/* اطلاعات تحصیلی */}
        <h3 className='text-2xl font-semibold mt-8 mb-4 text-white'>تحصیلات</h3>
        <ul className='list-disc list-inside text-lg leading-8 mb-6'>
          <li>نویسندگی هنری، انیمیشن و کارگردانی(صدا و سیما)</li>
          <li>حقوق</li>
          <li>دوره بلندمدت دوبله، چنگیز جلیلوند</li>
          <li>دوره نویسندگی و فن بیان خلاق، وزارت ارشاد</li>
        </ul>

        {/* سوابق کاری */}
        <h3 className='text-2xl font-semibold mt-8 mb-4 text-white'>
          سوابق کاری
        </h3>
        <ul className='list-disc list-inside text-lg leading-8'>
          <li>مدیر پروژه‌های تولیدی (۲۰۰۸ تا ۲۰۱۵)</li>
          <li>نویسندگی و کارگردانی فیلم سینمایی «حسرت»</li>
          <li>فیلم‌های سینمایی «توهم»، «نازنین»، «فرار»</li>
          <li>کارگردانی مستند و تیزرهای تبلیغاتی</li>
          <li>همکاری با شبکه‌های صدا و سیما</li>
          <li>دستیار کارگردان برنامه‌های تلویزیونی</li>
          <li>تدوین و صداگذاری آثار هنری</li>
          <li>دوبله با همکاری مرحوم چنگیز جلیلوند</li>
          <li>کارگردانی تئاترهای صحنه‌ای و مستندهای اجتماعی</li>
          <li>مدیریت پروژه‌های تولید فیلم کوتاه و هنری</li>
          <li>و بیش از ۲۰ پروژه‌ی دیگر در حوزه رسانه</li>
        </ul>
      </div>
    </section>
  )
}

export default BiographySection
